<?php defined('BASEPATH') OR exit('No direct script access allowed');

class Migration_add_table_district extends CI_Migration
{
    public function up()
    {
        //Структура таблицы `district`
        $this->db->query("
            CREATE TABLE IF NOT EXISTS `district` (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(255) NOT NULL,
              `filterid` int(11) NOT NULL DEFAULT '2',
              `cityid` int(11) NOT NULL DEFAULT '1',
              PRIMARY KEY (`id`)
            ) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=39 ;
        ");
        
        // Добавление данных в таблицу 'district'
        $this->db->query("
            INSERT INTO `district` (`id`, `name`, `filterid`, `cityid`) VALUES
                (1, 'Советский', 2, 1),
                (2, 'Железнодорожный', 2, 1),
                (3, 'Кировский', 2, 1),
                (4, 'Красноглинский', 2, 1),
                (5, 'Куйбышевский', 2, 1),
                (6, 'Ленинский', 2, 1),
                (7, 'Октябрьский', 2, 1),
                (8, 'Промышленный', 2, 1),
                (9, 'Самарский', 2, 1),
                (10, 'Центральный', 2, 2),
                (11, 'Автозаводский', 2, 2),
                (12, 'Комсомольский', 2, 2),
                (13, 'Жигулевск', 2, 2),
                (14, 'Авиастроительный', 2, 3),
                (15, 'Вахитовский', 2, 3),
                (16, 'Кировский', 2, 3),
                (17, 'Московский К', 2, 3),
                (18, 'Ново-Савиновский', 2, 3),
                (19, 'Приволжский', 2, 3),
                (20, 'Советский К', 2, 3),
                (21, 'Автозаводский Н', 2, 4),
                (22, 'Комсомольский Н', 2, 4),
                (23, 'Центральный Н', 2, 4),
                (24, 'Дёмский', 2, 6),
                (25, 'Калининский', 2, 6),
                (26, 'Кировский', 2, 6),
                (27, 'Ленинский', 2, 6),
                (28, 'Октябрьский', 2, 6),
                (29, 'Орджоникидзевский', 2, 6),
                (30, 'Советский', 2, 6),
                (31, 'Автозаводский НН', 2, 5),
                (32, 'Сормовский', 2, 5),
                (33, 'Канавинский', 2, 5),
                (34, 'Советский НН', 2, 5),
                (35, 'Ленинский НН', 2, 5),
                (36, 'Московский', 2, 5),
                (37, 'Нижегородский', 2, 5),
                (38, 'Приокский', 2, 5);
        ");
    }

    public function down()
    {
        $this->dbforge->drop_table('district');
    }
}